tests/test_02_cong2017/cases/BH4_Dr31_H066_L061/openfoam/3d/0.orig/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 296.15;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    closedEnd
    {
        type            zeroGradient;
    }
    reservoir
    {
        type            fixedValue;
        value           uniform 296.15;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 296.15;
        value           uniform 296.15;
    }
}
