tests/test_02_cong2017/cases/BH4_Dr31_H066_L061/openfoam/3d/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            noSlip;
    }
    closedEnd
    {
        type            noSlip;
    }
    reservoir
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
}
