tests/test_02_cong2017/cases/BH4_Dr31_H066_L061/openfoam/3d/0.orig/alpha.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 1;

boundaryField
{
    walls
    {
        // The paper reports acrylic but no contact angle; 90 deg is neutral.
        type            constantAlphaContactAngle;
        theta0          90;
        limit           gradient;
        value           uniform 1;
    }
    closedEnd
    {
        type            constantAlphaContactAngle;
        theta0          90;
        limit           gradient;
        value           uniform 0;
    }
    reservoir
    {
        type            fixedValue;
        value           uniform 1;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
}
