tests/test_02_cong2017/cases/BH4_Dr31_H066_L061/openfoam/3d/Allrun.resume
#!/bin/bash
cd "$(dirname "$0")"

source /usr/share/modules/init/bash 2>/dev/null || true
source /usr/lib/openfoam/openfoam2512/etc/bashrc
set -euo pipefail

if [[ ! -d processor0 ]]; then
    echo "No decomposed run is available to resume." >&2
    exit 1
fi

NP="${BH4_NP:-$(compgen -G 'processor*' | wc -l)}"
END_TIME="${BH4_END_TIME:-13.0}"
MAX_DELTA_T="${BH4_MAX_DELTA_T:-0.0005}"
LABEL="${BH4_LABEL:-base_topen0p20}"

restore_baseline_controls()
{
    printf 'endTime 13.0;\n' > system/endTime.inc
    printf 'maxDeltaT 0.0005;\n' > system/maxDeltaT.inc
}
trap restore_baseline_controls EXIT
printf 'endTime %s;\n' "$END_TIME" > system/endTime.inc
printf 'maxDeltaT %s;\n' "$MAX_DELTA_T" > system/maxDeltaT.inc

OMPI_ALLOW_RUN_AS_ROOT=1 \
OMPI_ALLOW_RUN_AS_ROOT_CONFIRM=1 \
mpirun -np "$NP" compressibleInterFoam -parallel \
    -decomposeParDict system/decomposeParDict.runtime \
    >> log.compressibleInterFoam 2>&1

python3 postprocess_compare.py \
    --case-dir . \
    --label "$LABEL" \
    --mesh-metadata mesh_metadata.json \
    > log.postprocess 2>&1
echo "BH4_3D_RESUME_DONE label=$LABEL endTime=$END_TIME"
