tests/test_02_cong2017/cases/BH4_Dr31_H066_L061/openfoam/3d/constant/g
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    object      g;
}

dimensions      [0 1 -2 0 0 0 0];
value           (0 0 -9.81);
