tests/test_02_cong2017/cases/BH4_Dr31_H066_L061/openfoam/3d/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// No inlet turbulence or fitted closure is reported.  A laminar baseline
// avoids using numerical/RANS dissipation to force the known no-geyser branch.
simulationType  laminar;
