tests/test_02_cong2017/cases/BH4_Dr31_H066_L061/openfoam/3d/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     compressibleInterFoam;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
#include "endTime.inc"
deltaT          1e-6;

writeControl    adjustableRunTime;
writeInterval   0.10;
purgeWrite      0;
writeFormat     binary;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   10;
runTimeModifiable yes;

adjustTimeStep  yes;
maxCo           0.40;
maxAlphaCo      0.20;
#include "maxDeltaT.inc"

functions
{
    alphaGasProxy
    {
        type            exprField;
        libs            (fieldFunctionObjects);
        field           alpha.gasProxy;
        useNamePrefix   false;
        autowrite       false;
        expression      "1-alpha.water";
        dimensions      [0 0 0 0 0 0 0];
        executeControl  adjustableRunTime;
        executeInterval 0.005;
        writeControl    none;
    }

    mixednessField
    {
        type            exprField;
        libs            (fieldFunctionObjects);
        field           interfaceMixedness;
        useNamePrefix   false;
        autowrite       false;
        expression      "4*alpha.water*(1-alpha.water)";
        dimensions      [0 0 0 0 0 0 0];
        executeControl  adjustableRunTime;
        executeInterval 0.005;
        writeControl    none;
    }

    gasMassDensityField
    {
        type            exprField;
        libs            (fieldFunctionObjects);
        field           gasMassDensity;
        useNamePrefix   false;
        autowrite       false;
        expression      "(1-alpha.water)*p/(287.05*T)";
        dimensions      [1 -3 0 0 0 0 0];
        executeControl  adjustableRunTime;
        executeInterval 0.005;
        writeControl    none;
    }

    waterMassDensityField
    {
        type            exprField;
        libs            (fieldFunctionObjects);
        field           waterMassDensity;
        useNamePrefix   false;
        autowrite       false;
        expression      "alpha.water*998";
        dimensions      [1 -3 0 0 0 0 0];
        executeControl  adjustableRunTime;
        executeInterval 0.005;
        writeControl    none;
    }

    numericalHealth
    {
        type            fieldMinMax;
        libs            (fieldFunctionObjects);
        fields          (T p p_rgh U alpha.water);
        mode            magnitude;
        location        yes;
        log             yes;
        writeToFile     false;
        writeControl    adjustableRunTime;
        writeInterval   0.02;
    }

    riserCentreline
    {
        type            probes;
        libs            (sampling);
        fields          (alpha.water U p p_rgh);
        probeLocations
        (
            #include "riserProbeLocations"
        );
        writeControl    adjustableRunTime;
        writeInterval   0.02;
    }

    horizontalCrown
    {
        type            probes;
        libs            (sampling);
        fields          (alpha.water p U);
        probeLocations
        (
            #include "horizontalProbeLocations"
        );
        writeControl    adjustableRunTime;
        writeInterval   0.02;
    }

    pt2Probe
    {
        type            probes;
        libs            (sampling);
        fields          (p p_rgh alpha.water U);
        probeLocations  ((3.470 0 0.004));
        writeControl    adjustableRunTime;
        writeInterval   0.005;
    }

    phaseVolumes
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        regionType      all;
        operation       volIntegrate;
        fields          (alpha.water alpha.gasProxy);
        writeFields     false;
        writeControl    adjustableRunTime;
        writeInterval   0.02;
    }

    phaseMasses
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        regionType      all;
        operation       volIntegrate;
        fields          (waterMassDensity gasMassDensity);
        writeFields     false;
        writeControl    adjustableRunTime;
        writeInterval   0.02;
    }

    interfaceMixedVolume
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        regionType      cellZone;
        name            riserZone;
        operation       volIntegrate;
        fields          (interfaceMixedness);
        writeFields     false;
        writeControl    adjustableRunTime;
        writeInterval   0.02;
    }

    pocketGasVolume
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        regionType      cellZone;
        name            pocketZone;
        operation       volIntegrate;
        fields          (alpha.gasProxy);
        writeFields     false;
        writeControl    adjustableRunTime;
        writeInterval   0.01;
    }

    pocketGasMass
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        regionType      cellZone;
        name            pocketZone;
        operation       volIntegrate;
        fields          (gasMassDensity);
        writeFields     false;
        writeControl    adjustableRunTime;
        writeInterval   0.01;
    }

    pocketPressure
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        regionType      cellZone;
        name            pocketZone;
        operation       weightedVolAverage;
        weightField     alpha.gasProxy;
        fields          (p);
        writeFields     false;
        writeControl    adjustableRunTime;
        writeInterval   0.005;
    }

    pt2Pressure
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        regionType      cellZone;
        name            pt2Zone;
        operation       volAverage;
        fields          (p);
        writeFields     false;
        writeControl    adjustableRunTime;
        writeInterval   0.005;
    }

    valveVolumeFlux
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            valveCoupleUpstream;
        operation       sum;
        fields          (phi);
        writeFields     false;
        writeControl    adjustableRunTime;
        writeInterval   0.005;
    }

    valveUpstreamPressure
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            valveWallUpstream;
        operation       areaAverage;
        fields          (p);
        writeFields     false;
        writeControl    adjustableRunTime;
        writeInterval   0.005;
    }

    valveDownstreamPressure
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            valveWallDownstream;
        operation       areaAverage;
        fields          (p);
        writeFields     false;
        writeControl    adjustableRunTime;
        writeInterval   0.005;
    }

    externalWaterVolume
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        regionType      cellZone;
        name            externalZone;
        operation       volIntegrate;
        fields          (alpha.water);
        writeFields     false;
        writeControl    adjustableRunTime;
        writeInterval   0.02;
    }

    atmosphereWaterVolumeFlux
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            atmosphere;
        operation       weightedSum;
        weightField     alpha.water;
        fields          (phi);
        writeFields     false;
        writeControl    adjustableRunTime;
        writeInterval   0.01;
    }

    reservoirWaterVolumeFlux
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            reservoir;
        operation       weightedSum;
        weightField     alpha.water;
        fields          (phi);
        writeFields     false;
        writeControl    adjustableRunTime;
        writeInterval   0.01;
    }

    atmosphereGasMassFlux
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            atmosphere;
        operation       weightedSum;
        weightField     alpha.gasProxy;
        fields          (rhoPhi);
        writeFields     false;
        writeControl    adjustableRunTime;
        writeInterval   0.01;
    }
}
