tests/test_02_cong2017/cases/BH4_Dr31_H066_L061/openfoam/3d/system/createBafflesDict
/* Generated by configure_valve.py: opening over 0.2 s.
   The coupled area is the prescribed opening; the remainder is a no-slip wall. */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}

internalFacesOnly true;

baffles
{
    ballValve4
    {
        type        faceZone;
        zoneName    valveFaces;

        patches
        {
            master
            {
                name            valveCoupleUpstream;
                type            cyclicACMI;
                neighbourPatch  valveCoupleDownstream;
                nonOverlapPatch valveWallUpstream;
                scale table
                (
                    (0 0)
                    (0.025 0.04296875)
                    (0.05 0.15625)
                    (0.075 0.31640625)
                    (0.1 0.5)
                    (0.125 0.68359375)
                    (0.15 0.84375)
                    (0.175 0.95703125)
                    (0.2 1)
                    (100 1)
                );

                patchFields
                {
                    U
                    {
                        type cyclicACMI;
                    }
                    p
                    {
                        type cyclicACMI;
                    }
                    p_rgh
                    {
                        type cyclicACMI;
                    }
                    alpha.water
                    {
                        type cyclicACMI;
                    }
                    T
                    {
                        type cyclicACMI;
                    }
                }
            }
            slave
            {
                name            valveCoupleDownstream;
                type            cyclicACMI;
                neighbourPatch  valveCoupleUpstream;
                nonOverlapPatch valveWallDownstream;

                patchFields
                {
                    ${../../master/patchFields}
                }
            }
            master2
            {
                name            valveWallUpstream;
                type            wall;

                patchFields
                {
                    U
                    {
                        type noSlip;
                    }
                    p
                    {
                        type calculated;
                        value uniform 107786.651;
                    }
                    p_rgh
                    {
                        type fixedFluxPressure;
                        value uniform 107786.651;
                    }
                    alpha.water
                    {
                        type constantAlphaContactAngle;
                        theta0 90;
                        limit gradient;
                        value uniform 1;
                    }
                    T
                    {
                        type zeroGradient;
                    }
                }
            }
            slave2
            {
                name            valveWallDownstream;
                type            wall;

                patchFields
                {
                    U
                    {
                        type noSlip;
                    }
                    p
                    {
                        type calculated;
                        value uniform 101325;
                    }
                    p_rgh
                    {
                        type fixedFluxPressure;
                        value uniform 101325;
                    }
                    alpha.water
                    {
                        type constantAlphaContactAngle;
                        theta0 90;
                        limit gradient;
                        value uniform 0;
                    }
                    T
                    {
                        type zeroGradient;
                    }
                }
            }
        }
    }
}
