tests/test_02_cong2017/cases/BH4_Dr31_H066_L061/openfoam/3d/system/createPatchDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

pointSync false;

patches
(
    {
        name walls;
        patchInfo { type wall; }
        constructFrom patches;
        patches (walls);
    }
    {
        name closedEnd;
        patchInfo { type wall; }
        constructFrom patches;
        patches (closedEnd);
    }
    {
        name reservoir;
        patchInfo { type patch; }
        constructFrom patches;
        patches (reservoir);
    }
    {
        name atmosphere;
        patchInfo { type patch; }
        constructFrom patches;
        patches (atmosphere);
    }
);
