tests/test_02_cong2017/cases/BH4_Dr31_H066_L061/openfoam/3d/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         cellLimited Gauss linear 1;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    // Bounded geometric VOF transport; no artificial phase/velocity source.
    div(phi,alpha)  Gauss vanLeer;
    div(phirb,alpha) Gauss linear;

    // Less dissipative than first-order upwind for the critical no-geyser test.
    div(rhoPhi,U)   Gauss linearUpwind grad(U);
    div(rhoPhi,T)   Gauss upwind;
    div(rhoPhi,K)   Gauss upwind;
    div(phi,p)      Gauss upwind;
    div(phi,k)      Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 0.5;
}
