tests/test_02_cong2017/cases/BH4_Dr31_H066_L061/openfoam/3d/system/horizontalProbeLocations
(3.470 0 0.045)
(3.520 0 0.045)
(3.570 0 0.045)
(3.620 0 0.045)
(3.670 0 0.045)
(3.720 0 0.045)
(3.770 0 0.045)
(3.820 0 0.045)
(3.870 0 0.045)
(3.920 0 0.045)
(3.970 0 0.045)
(4.020 0 0.045)
(4.070 0 0.045)
(4.120 0 0.045)
(4.170 0 0.045)
(4.220 0 0.045)
(4.270 0 0.045)
(4.320 0 0.045)
(4.370 0 0.045)
(4.420 0 0.045)
(4.470 0 0.045)
(4.520 0 0.045)
(4.570 0 0.045)
(4.620 0 0.045)
(4.670 0 0.045)
(4.720 0 0.045)
(4.770 0 0.045)
(4.820 0 0.045)
(4.870 0 0.045)
(4.920 0 0.045)
(4.970 0 0.045)
(5.020 0 0.045)
(5.070 0 0.045)
(5.120 0 0.045)
(5.170 0 0.045)
(5.220 0 0.045)
(5.270 0 0.045)
(5.320 0 0.045)
(5.370 0 0.045)
(5.420 0 0.045)
(5.470 0 0.045)
(5.520 0 0.045)
(5.570 0 0.045)
(5.620 0 0.045)
(5.670 0 0.045)
(5.720 0 0.045)
(5.770 0 0.045)
(5.820 0 0.045)
(5.870 0 0.045)
(5.920 0 0.045)
(5.970 0 0.045)
