tests/test_02_cong2017/cases/BH4_Dr31_H066_L061/openfoam/3d/system/meshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshDict;
}

surfaceFile     "bh4-physical.stl";
maxCellSize     0.025;
boundaryCellSize 0.025;

localRefinement
{
    pipeWall
    {
        cellSize 0.006375;
        refinementThickness 0.0125;
    }
    riserWall
    {
        cellSize 0.0039525;
        refinementThickness 0.00775;
    }
    "(reservoir|closedEnd)"
    {
        cellSize 0.006375;
    }
    deck
    {
        cellSize 0.025;
    }
}

objectRefinements
{
    mainPipe
    {
        type box;
        centre (3.295 0 0.025);
        lengthX 6.61;
        lengthY 0.07;
        lengthZ 0.07;
        cellSize 0.006375;
    }
    riser
    {
        type cone;
        p0 (3.47 0 0.025);
        radius0 0.0275;
        p1 (3.47 0 1.87);
        radius1 0.0275;
        cellSize 0.0039525;
    }
    tee
    {
        type sphere;
        centre (3.47 0 0.025);
        radius 0.04;
        cellSize 0.00197625;
    }
    valve
    {
        type box;
        centre (5.98 0 0.025);
        lengthX 0.08;
        lengthY 0.07;
        lengthZ 0.07;
        cellSize 0.006375;
    }
    plume
    {
        type box;
        centre (3.47 0 2.45);
        lengthX 0.14;
        lengthY 0.14;
        lengthZ 1.2;
        cellSize 0.01275;
    }
}

boundaryLayers
{
    // Do not extrude a wall layer at the sharp circular-tee intersection.
    nLayers 0;
}

renameBoundary
{
    defaultName     walls;
    defaultType     wall;
    newPatchNames
    {
        atmosphere { newName atmosphere; type patch; }
        reservoir  { newName reservoir;  type patch; }
        closedEnd  { newName closedEnd;  type wall; }
        "(pipeWall|riserWall|deck)"
        {
            newName walls;
            type wall;
        }
    }
}
