tests/test_02_cong2017/cases/BH4_Dr31_H066_L061/openfoam/3d/system/riserProbeLocations
(3.470 0 0.060)
(3.470 0 0.080)
(3.470 0 0.100)
(3.470 0 0.120)
(3.470 0 0.140)
(3.470 0 0.160)
(3.470 0 0.180)
(3.470 0 0.200)
(3.470 0 0.220)
(3.470 0 0.240)
(3.470 0 0.260)
(3.470 0 0.280)
(3.470 0 0.300)
(3.470 0 0.320)
(3.470 0 0.340)
(3.470 0 0.360)
(3.470 0 0.380)
(3.470 0 0.400)
(3.470 0 0.420)
(3.470 0 0.440)
(3.470 0 0.460)
(3.470 0 0.480)
(3.470 0 0.500)
(3.470 0 0.520)
(3.470 0 0.540)
(3.470 0 0.560)
(3.470 0 0.580)
(3.470 0 0.600)
(3.470 0 0.620)
(3.470 0 0.640)
(3.470 0 0.660)
(3.470 0 0.680)
(3.470 0 0.700)
(3.470 0 0.720)
(3.470 0 0.740)
(3.470 0 0.760)
(3.470 0 0.780)
(3.470 0 0.800)
(3.470 0 0.820)
(3.470 0 0.840)
(3.470 0 0.860)
(3.470 0 0.880)
(3.470 0 0.900)
(3.470 0 0.920)
(3.470 0 0.940)
(3.470 0 0.960)
(3.470 0 0.980)
(3.470 0 1.000)
(3.470 0 1.020)
(3.470 0 1.040)
(3.470 0 1.060)
(3.470 0 1.080)
(3.470 0 1.100)
(3.470 0 1.120)
(3.470 0 1.140)
(3.470 0 1.160)
(3.470 0 1.180)
(3.470 0 1.200)
(3.470 0 1.220)
(3.470 0 1.240)
(3.470 0 1.260)
(3.470 0 1.280)
(3.470 0 1.300)
(3.470 0 1.320)
(3.470 0 1.340)
(3.470 0 1.360)
(3.470 0 1.380)
(3.470 0 1.400)
(3.470 0 1.420)
(3.470 0 1.440)
(3.470 0 1.460)
(3.470 0 1.480)
(3.470 0 1.500)
(3.470 0 1.520)
(3.470 0 1.540)
(3.470 0 1.560)
(3.470 0 1.580)
(3.470 0 1.600)
(3.470 0 1.620)
(3.470 0 1.640)
(3.470 0 1.660)
(3.470 0 1.680)
(3.470 0 1.700)
(3.470 0 1.720)
(3.470 0 1.740)
(3.470 0 1.760)
(3.470 0 1.780)
(3.470 0 1.800)
(3.470 0 1.820)
(3.470 0 1.840)
(3.470 0 1.860)
(3.470 0 1.880)
(3.470 0 1.900)
(3.470 0 1.920)
(3.470 0 1.940)
(3.470 0 1.960)
(3.470 0 1.980)
(3.470 0 2.000)
(3.470 0 2.020)
(3.470 0 2.040)
(3.470 0 2.060)
(3.470 0 2.080)
(3.470 0 2.100)
(3.470 0 2.120)
(3.470 0 2.140)
(3.470 0 2.160)
(3.470 0 2.180)
(3.470 0 2.200)
(3.470 0 2.220)
(3.470 0 2.240)
(3.470 0 2.260)
(3.470 0 2.280)
(3.470 0 2.300)
(3.470 0 2.320)
(3.470 0 2.340)
(3.470 0 2.360)
(3.470 0 2.380)
(3.470 0 2.400)
(3.470 0 2.420)
(3.470 0 2.440)
(3.470 0 2.460)
(3.470 0 2.480)
(3.470 0 2.500)
(3.470 0 2.520)
(3.470 0 2.540)
(3.470 0 2.560)
(3.470 0 2.580)
(3.470 0 2.600)
(3.470 0 2.620)
(3.470 0 2.640)
(3.470 0 2.660)
(3.470 0 2.680)
(3.470 0 2.700)
(3.470 0 2.720)
(3.470 0 2.740)
(3.470 0 2.760)
(3.470 0 2.780)
(3.470 0 2.800)
(3.470 0 2.820)
(3.470 0 2.840)
(3.470 0 2.860)
(3.470 0 2.880)
(3.470 0 2.900)
(3.470 0 2.920)
(3.470 0 2.940)
(3.470 0 2.960)
(3.470 0 2.980)
(3.470 0 3.000)
(3.470 0 3.020)
(3.470 0 3.040)
